## Import Data
Importing CSVs and converting into <em>Pandas</em> data frames.

### Trade Statistics - Exports

In [ ]:
import pandas as pd

In [47]:
df = pd.read_csv('resources/tradeStats_exports.csv')

In [48]:
# Transpose row and columns
transposed_df = df.T
transposed_df = transposed_df.rename(index={"Unnamed: 0":""})
transposed_df.head(3)

,0,1,2,3,4,5,6,7,8,9,...,45,46,47,48,49,50,51,52,53,54
,Angola,Bolivia (Plurinational State of),Brazil,Burundi,Cameroon,Central African Republic,Colombia,Congo,Costa Rica,Cote d'Ivoire,...,Thailand,Timor-Leste,Togo,Trinidad & Tobago,Uganda,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
1990,84.35,156.442,16935.7876,584.773,2611.259,196.698,13943.87,1.68,2265.644,4282.866,...,1001.435,0.0,238.838,30.232,2352.68,277.795,1145.234001,50.0,24.36,250.772
1991,70.501,73.523,21182.7614,687.851,1752.179,140.95,12599.185,0.924,2399.64,3804.734001,...,540.937,0.0,154.834,7.671998,2095.093,127.889,1200.952,71.666997,29.198,239.324

In [49]:
# Reset header columns
header_row = ""
transposed_df.columns = transposed_df.loc[header_row]
resetHead_df = transposed_df.drop(header_row)
resetHead_df.index.name = "Year"
resetHead_df.head(3)

,Angola,Bolivia (Plurinational State of),Brazil,Burundi,Cameroon,Central African Republic,Colombia,Congo,Costa Rica,Cote d'Ivoire,...,Thailand,Timor-Leste,Togo,Trinidad & Tobago,Uganda,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
Year,,,,,,,,,,,,,,,,,,,,,
1990,84.35,156.442,16935.7876,584.773,2611.259,196.698,13943.87,1.68,2265.644,4282.866,...,1001.435,0.0,238.838,30.232,2352.68,277.795,1145.234001,50.0,24.36,250.772
1991,70.501,73.523,21182.7614,687.851,1752.179,140.95,12599.185,0.924,2399.64,3804.734001,...,540.937,0.0,154.834,7.671998,2095.093,127.889,1200.952,71.666997,29.198,239.324
1992,80.25,96.204,18790.7192,645.858,1645.851,99.975,16564.37,0.336,2431.340001,4546.368,...,1163.776001,0.0,313.177,2.451,1961.034,135.818001,1937.611,36.989002,30.514,162.318

In [50]:
# Fill any Null values with 0
resetHead_df = resetHead_df.fillna(0)

### Trade Statistics - Imports

In [ ]:
df = pd.read_csv('resources/tradeStats_imports.csv')

In [20]:
# Transpose row and columns
transposed_df = df.T
transposed_df = transposed_df.rename(index={"Unnamed: 0":""})
transposed_df.head(3)

,0,1,2,3,4,5,6,7,8,9,...,25,26,27,28,29,30,31,32,33,34
,Austria,Belgium,Belgium/Luxembourg,Bulgaria,Croatia,Cyprus,Czechia,Denmark,Estonia,Finland,...,Slovenia,Spain,Sweden,Japan,Norway,Russian Federation,Switzerland,Tunisia,United Kingdom,United States of America
1990,1879.717004,NaN,2014.954017,268.182998,NaN,49.853999,659.433,959.105004,NaN,1095.140998,...,0.0,3053.251001,1766.674003,5329.750004,742.040002,0.0,1170.508002,100.999998,2898.298008,21006.78601
1991,2058.271005,NaN,1746.225019,200.220001,NaN,53.926,525.274,982.757004,NaN,1033.066999,...,0.0,2969.543,1717.087,5510.469001,761.214999,0.0,1130.292002,90.201001,2805.914005,19839.63001

In [21]:
# Reset header columns
header_row = ""
transposed_df.columns = transposed_df.loc[header_row]
resetHead_df = transposed_df.drop(header_row)
resetHead_df.index.name = "Year"
resetHead_df.head(3)

,Austria,Belgium,Belgium/Luxembourg,Bulgaria,Croatia,Cyprus,Czechia,Denmark,Estonia,Finland,...,Slovenia,Spain,Sweden,Japan,Norway,Russian Federation,Switzerland,Tunisia,United Kingdom,United States of America
Year,,,,,,,,,,,,,,,,,,,,,
1990,1879.717004,NaN,2014.954017,268.182998,NaN,49.853999,659.433,959.105004,NaN,1095.140998,...,0.0,3053.251001,1766.674003,5329.750004,742.040002,0.0,1170.508002,100.999998,2898.298008,21006.78601
1991,2058.271005,NaN,1746.225019,200.220001,NaN,53.926,525.274,982.757004,NaN,1033.066999,...,0.0,2969.543,1717.087,5510.469001,761.214999,0.0,1130.292002,90.201001,2805.914005,19839.63001
1992,2206.416005,NaN,1827.85102,182.231012,168.190005,40.875999,474.731003,1061.623004,16.378,1055.361,...,122.875,3414.290003,1771.725002,5325.615998,739.145001,1381.858008,1101.251002,110.583001,3088.172009,22939.03301

In [26]:
# Fill any Null values with 0
resetHead_df = resetHead_df.fillna(0)
resetHead_df.head(3)

,Austria,Belgium,Belgium/Luxembourg,Bulgaria,Croatia,Cyprus,Czechia,Denmark,Estonia,Finland,...,Slovenia,Spain,Sweden,Japan,Norway,Russian Federation,Switzerland,Tunisia,United Kingdom,United States of America
Year,,,,,,,,,,,,,,,,,,,,,
1990,1879.717004,0.0,2014.954017,268.182998,0.000000,49.853999,659.433000,959.105004,0.000,1095.140998,...,0.000,3053.251001,1766.674003,5329.750004,742.040002,0.000000,1170.508002,100.999998,2898.298008,21006.78601
1991,2058.271005,0.0,1746.225019,200.220001,0.000000,53.926000,525.274000,982.757004,0.000,1033.066999,...,0.000,2969.543000,1717.087000,5510.469001,761.214999,0.000000,1130.292002,90.201001,2805.914005,19839.63001
1992,2206.416005,0.0,1827.851020,182.231012,168.190005,40.875999,474.731003,1061.623004,16.378,1055.361000,...,122.875,3414.290003,1771.725002,5325.615998,739.145001,1381.858008,1101.251002,110.583001,3088.172009,22939.03301

### Price to Growers - Colombian Milds

In [31]:
df = pd.read_csv('resources/priceGrowers_colombianMilds.csv')

In [32]:
# Transpose row and columns
transposed_df = df.T
transposed_df = transposed_df.rename(index={"Unnamed: 0":""})
transposed_df.head(3)

             0        1         2
      Colombia    Kenya  Tanzania
1990    69.523  60.5721   40.8183
1991   67.1251  50.6778   49.5039

In [33]:
# Reset header columns
header_row = ""
transposed_df.columns = transposed_df.loc[header_row]
resetHead_df = transposed_df.drop(header_row)
resetHead_df.index.name = "Year"
resetHead_df.head(3)

     Colombia    Kenya Tanzania
Year
1990   69.523  60.5721  40.8183
1991  67.1251  50.6778  49.5039
1992  54.5709  28.9495  49.1581

In [34]:
# Fill any Null values with 0
resetHead_df = resetHead_df.fillna(0)
resetHead_df.head(3)

      Colombia    Kenya  Tanzania
Year
1990   69.5230  60.5721   40.8183
1991   67.1251  50.6778   49.5039
1992   54.5709  28.9495   49.1581

### Price to Growers - Other Milds

In [35]:
df = pd.read_csv('resources/priceGrowers_otherMilds.csv')

In [36]:
# Transpose row and columns
transposed_df = df.T
transposed_df = transposed_df.rename(index={"Unnamed: 0":""})
transposed_df.head(3)

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
,Bolivia (Plurinational State of),Burundi,Cameroon,Costa Rica,Cuba,Democratic Republic of Congo,Dominican Republic,Ecuador,El Salvador,Guatemala,...,Nicaragua,Panama,Papa New Guinea,Peru,Rwanda,Sri Lanka,Uganda,Venezuela,Zambia,Zimbabwe
1990,51.7802,58.0195,32.2852,58.4893,171.4282,NaN,66.055,35.2113,50.5636,54.5845,...,NaN,49.304,65.5004,90.3729,74.2047,NaN,15.2932,NaN,89.7541,NaN
1991,52.423,55.0206,28.2347,52.7258,171.4282,NaN,62.6429,36.1803,44.5445,57.5349,...,44.137,47.2497,64.5333,NaN,50.3764,NaN,29.6408,NaN,70.3159,NaN

In [37]:
# Reset header columns
header_row = ""
transposed_df.columns = transposed_df.loc[header_row]
resetHead_df = transposed_df.drop(header_row)
resetHead_df.index.name = "Year"
resetHead_df.head(3)

,Bolivia (Plurinational State of),Burundi,Cameroon,Costa Rica,Cuba,Democratic Republic of Congo,Dominican Republic,Ecuador,El Salvador,Guatemala,...,Nicaragua,Panama,Papa New Guinea,Peru,Rwanda,Sri Lanka,Uganda,Venezuela,Zambia,Zimbabwe
Year,,,,,,,,,,,,,,,,,,,,,
1990,51.7802,58.0195,32.2852,58.4893,171.4282,NaN,66.055,35.2113,50.5636,54.5845,...,NaN,49.304,65.5004,90.3729,74.2047,NaN,15.2932,NaN,89.7541,NaN
1991,52.423,55.0206,28.2347,52.7258,171.4282,NaN,62.6429,36.1803,44.5445,57.5349,...,44.137,47.2497,64.5333,NaN,50.3764,NaN,29.6408,NaN,70.3159,NaN
1992,43.5276,59.234,28.7593,49.9093,179.9996,NaN,46.5612,29.0799,30.9092,40.2309,...,44.137,44.3736,57.9582,31.9698,48.9068,NaN,19.9953,NaN,34.9584,NaN

In [38]:
# Fill any Null values with 0
resetHead_df = resetHead_df.fillna(0)
resetHead_df.head(3)

,Bolivia (Plurinational State of),Burundi,Cameroon,Costa Rica,Cuba,Democratic Republic of Congo,Dominican Republic,Ecuador,El Salvador,Guatemala,...,Nicaragua,Panama,Papa New Guinea,Peru,Rwanda,Sri Lanka,Uganda,Venezuela,Zambia,Zimbabwe
Year,,,,,,,,,,,,,,,,,,,,,
1990,51.7802,58.0195,32.2852,58.4893,171.4282,0.0,66.0550,35.2113,50.5636,54.5845,...,0.000,49.3040,65.5004,90.3729,74.2047,0.0,15.2932,0,89.7541,0
1991,52.4230,55.0206,28.2347,52.7258,171.4282,0.0,62.6429,36.1803,44.5445,57.5349,...,44.137,47.2497,64.5333,0.0000,50.3764,0.0,29.6408,0,70.3159,0
1992,43.5276,59.2340,28.7593,49.9093,179.9996,0.0,46.5612,29.0799,30.9092,40.2309,...,44.137,44.3736,57.9582,31.9698,48.9068,0.0,19.9953,0,34.9584,0

### Price to Growers - Brazilian Naturals

In [43]:
df = pd.read_csv('resources/priceGrowers_brazilianNaturals.csv')

In [44]:
# Transpose row and columns
transposed_df = df.T
transposed_df = transposed_df.rename(index={"Unnamed: 0":""})
transposed_df.head(3)

           0        1         2          3             4         5        6
      Angola   Brazil  Ethiopia  Indonesia  Phillippines  Thailand  Vietnam
1990     NaN  54.3248     61.09        NaN           NaN       NaN      NaN
1991     NaN  43.9931   68.1911        NaN           NaN       NaN      NaN

In [45]:
# Reset header columns
header_row = ""
transposed_df.columns = transposed_df.loc[header_row]
resetHead_df = transposed_df.drop(header_row)
resetHead_df.index.name = "Year"
resetHead_df.head(3)

     Angola   Brazil Ethiopia Indonesia Phillippines Thailand Vietnam
Year
1990    NaN  54.3248    61.09       NaN          NaN      NaN     NaN
1991    NaN  43.9931  68.1911       NaN          NaN      NaN     NaN
1992    NaN  45.1989  61.2061       NaN      55.7355      NaN     NaN

In [46]:
# Fill any Null values with 0
resetHead_df = resetHead_df.fillna(0)
resetHead_df.head(3)

      Angola   Brazil  Ethiopia  Indonesia  Phillippines  Thailand  Vietnam
Year
1990     0.0  54.3248   61.0900        0.0        0.0000       0.0      0.0
1991     0.0  43.9931   68.1911        0.0        0.0000       0.0      0.0
1992     0.0  45.1989   61.2061        0.0       55.7355       0.0      0.0

### Price to Growers - Robustas

In [55]:
df = pd.read_csv('resources/priceGrowers_robustas.csv')

In [56]:
# Transpose row and columns
transposed_df = df.T
transposed_df = transposed_df.rename(index={"Unnamed: 0":""})
transposed_df.head(3)

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
,Angola,Benin,Brazil,Burundi,Cameroon,Central African Republic,Congo,Cote d'Ivoire,Democratic Republic of Congo,Ecuador,...,Papua New Guinea,Phillippines,Sierra Leone,Sri Lanka,Tanzania,Thailand,Togo,Trinidad & Tobago,Uganda,Vietnam
1990,85.6569,53.7609,34.8486,NaN,28.3337,36.7471,19.2087,33.4064,4.5201,19.0602,...,26.5984,34.2253,26.1686,26.8959,17.007,37.7181,29.2306,62.5882,7.5418,36.9183
1991,91.1153,22.8961,27.4947,NaN,25.0078,36.6398,18.5542,32.2682,NaN,17.8351,...,29.4778,34.6061,NaN,25.2906,17.1071,18.3728,28.6435,62.5882,11.8428,30.7256

In [57]:
# Reset header columns
header_row = ""
transposed_df.columns = transposed_df.loc[header_row]
resetHead_df = transposed_df.drop(header_row)
resetHead_df.index.name = "Year"
resetHead_df.head(3)

,Angola,Benin,Brazil,Burundi,Cameroon,Central African Republic,Congo,Cote d'Ivoire,Democratic Republic of Congo,Ecuador,...,Papua New Guinea,Phillippines,Sierra Leone,Sri Lanka,Tanzania,Thailand,Togo,Trinidad & Tobago,Uganda,Vietnam
Year,,,,,,,,,,,,,,,,,,,,,
1990,85.6569,53.7609,34.8486,NaN,28.3337,36.7471,19.2087,33.4064,4.5201,19.0602,...,26.5984,34.2253,26.1686,26.8959,17.007,37.7181,29.2306,62.5882,7.5418,36.9183
1991,91.1153,22.8961,27.4947,NaN,25.0078,36.6398,18.5542,32.2682,NaN,17.8351,...,29.4778,34.6061,NaN,25.2906,17.1071,18.3728,28.6435,62.5882,11.8428,30.7256
1992,44.9183,24.0067,27.5947,47.1618,24.2466,33.9318,19.7491,31.7589,NaN,23.307,...,39.1005,42.4765,NaN,31.8496,14.8403,20.3048,29.8298,69.2941,8.9537,30.707

In [58]:
# Fill any Null values with 0
resetHead_df = resetHead_df.fillna(0)
resetHead_df.head(3)

,Angola,Benin,Brazil,Burundi,Cameroon,Central African Republic,Congo,Cote d'Ivoire,Democratic Republic of Congo,Ecuador,...,Papua New Guinea,Phillippines,Sierra Leone,Sri Lanka,Tanzania,Thailand,Togo,Trinidad & Tobago,Uganda,Vietnam
Year,,,,,,,,,,,,,,,,,,,,,
1990,85.6569,53.7609,34.8486,0.0000,28.3337,36.7471,19.2087,33.4064,4.5201,19.0602,...,26.5984,34.2253,26.1686,26.8959,17.0070,37.7181,29.2306,62.5882,7.5418,36.9183
1991,91.1153,22.8961,27.4947,0.0000,25.0078,36.6398,18.5542,32.2682,0.0000,17.8351,...,29.4778,34.6061,0.0000,25.2906,17.1071,18.3728,28.6435,62.5882,11.8428,30.7256
1992,44.9183,24.0067,27.5947,47.1618,24.2466,33.9318,19.7491,31.7589,0.0000,23.3070,...,39.1005,42.4765,0.0000,31.8496,14.8403,20.3048,29.8298,69.2941,8.9537,30.7070